###Q1.Create a pandas data structure 'Series' with data=[100,200,300,400,500] and index=['tom','bob','nancy','dan','eric']

In [0]:
import pandas as pd
import numpy as np

In [0]:
series = pd.Series([100,200,300,400,500],
                   index = ['tom','bob','nancy','dan','eric'])
series

tom      100
bob      200
nancy    300
dan      400
eric     500
dtype: int64

####a) Change data at index 2 by 'foo'. Print Series.

In [0]:
series['nancy'] = 'foo'
series

tom      100
bob      200
nancy    foo
dan      400
eric     500
dtype: object

####b) Print data corresponding to index ‘nancy’, ‘tom’, ‘eric’ in a single statement.

In [0]:
print(series[['nancy','tom','eric']])

nancy    foo
tom      100
eric     500
dtype: object

####c) Multiply series data by 2 and print result.

In [0]:
series.multiply(2)

tom         200
bob         400
nancy    foofoo
dan         800
eric       1000
dtype: object

####d) Power series data by 2 corresponding to index value ‘tom’ and ‘dan’.

In [0]:
series[['tom','dan']].pow(2)

tom     10000
dan    160000
dtype: object

###Q2. Create a dictionary ‘d’ having key-value pair as-

####One: Series(data= [100,300,600], index=[‘apple’ , ’ball’ , ’clock’]

####Two: Series(data=[111,333,666], index=[‘apple’, ‘ball’, ‘bat’]

####A) Create a data frame ‘df’ using above dictionary ‘d’.

In [0]:
one = pd.Series(data=[100, 300, 600],
               index=['apple', 'ball', 'clock'])
two = pd.Series(data=[111, 333, 666],
               index=['apple', 'ball', 'bat'])

d = {'one': one, 'two': two}

df = pd.DataFrame(d)
df

         one    two
apple  100.0  111.0
ball   300.0  333.0
bat      NaN  666.0
clock  600.0    NaN



####B) Create another data frame df1 using ‘d’ having index = [‘bat’, ‘ball’, ‘apple’] and columns = [‘two’, ‘one’]

In [0]:
df1 = pd.DataFrame(d,index=['bat', 'ball', 'apple'],
                     columns=['two', 'one'])
print(df1)

       two    one
bat    666    NaN
ball   333  300.0
apple  111  100.0

####C) Print the column one data in ‘df’.

In [0]:
df['one']

apple    100.0
ball     300.0
bat        NaN
clock    600.0
Name: one, dtype: float64

####D) Insert a column named ‘three’ having values as sum of column ‘one’ and ‘two’.

In [0]:
df['three'] = df['one'] + df['two']
df

         one    two  three
apple  100.0  111.0  211.0
ball   300.0  333.0  633.0
bat      NaN  666.0    NaN
clock  600.0    NaN    NaN

####E) Delete column ‘one’ from ‘df’ using “pop” function, further print values and type of deleted column.

In [0]:
df.pop('one')

apple    100.0
ball     300.0
bat        NaN
clock    600.0
Name: one, dtype: float64

In [0]:
print(df)

         two  three
apple  111.0  211.0
ball   333.0  633.0
bat    666.0    NaN
clock    NaN    NaN





####F) Delete column ‘two’ from ‘df’ using del function.

In [0]:
del df['two']
df

       three
apple  211.0
ball   633.0
bat      NaN
clock    NaN

####G) Insert a column in ‘df’ named as ‘three_upper_half’ having only top two values of column ‘three’.

In [0]:
df['three_upper_half'] = df['three'][:2]
df

       three  three_upper_half
apple  211.0             211.0
ball   633.0             633.0
bat      NaN               NaN
clock    NaN               NaN